Autodesk.Revit.UI.FormaNotificationIcon
The icon type used in the toast notification.
Since:
2027
Since:
2027

Autodesk.Revit.UI.FormaNotificationIcon.Error
Indicates a failed operation.

Autodesk.Revit.UI.FormaNotificationIcon.Warning
Indicates a warning.

Autodesk.Revit.UI.FormaNotificationIcon.Success
Indicates a successful operation.

Autodesk.Revit.UI.FormaNotificationIcon.Information
Indicates a general information.